{
    "Devotional archive": [
        "Sun Jul 21, 2013",
        "I finally got around to digging up all the old devotionals I had stashed away on old forums and cloud servers. Click on any of the below links to listen to the audio. 6-20-136-13-135-30-135-23-135-9-135-2-134-25-134-18-134-11-134-4-133-28-133-21-133-14-133-7-132-28-132-14-132-7-131-31-131-24-131-17-131-10-131-3-1312-27-1212-21-1212-13-1212-6-1211-8-1211-1-1210-25-1210-18-1210-4-129-27-129-20-129-13-12",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSRWhrS1VrYUZhck0/view?usp=sharing"
    ],
    "Devotionals for 8-19-19": [
        "Mon Aug 19, 2019",
        "Tithing is just an old testament requirement right? I mean..we don't still have to do that do we? John talks tonight about the importance of tithing and what that level of commitment can mean to the church and also to you.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%208-19-19.mp3"
    ],
    "Devotionals for 8-12-19": [
        "Mon Aug 12, 2019",
        "Feeling a little distracted and not fully engaged in what you know God wants from you? Ron asked us tonight if we have zeal for God? As Christians we should be Christ like in our zeal for God and Jesus is our ultimate example of what that looks like.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%208-12-19.mp3"
    ],
    "Devotionals for 8-5-19": [
        "Mon Aug 12, 2019",
        "Life ever seem chaotic? Brandon share a message tonight on just how we can and need to prioritize in our life to help our christian walk.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%208-5-19.mp3"
    ],
    "Devotionals for 7-29-18": [
        "Mon Jul 29, 2019",
        "During this weeks devotional, Mandee asked us if we are working on cultivating our faith or are we just cruising through? Faith is a critical part of our relationship with God but what does it really mean to have faith and walk in faith? Mandee shared some great incites this week that will be sure to answer these questions and more.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%207-29-19.mp3"
    ],
    "Devotionals for 7-22-19": [
        "Mon Jul 22, 2019",
        "What do you know about the mark of the beast referenced in the book of Revelations? John talked tonight about what we know for sure concerning the mark and what we don't yet know. This was an interesting devotional about parts of the bible that don't get discussed as often as they maybe should.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%207-22-19.mp3"
    ],
    "Devotionals for 7-15-18": [
        "Mon Jul 15, 2019",
        "Psalm 71 was the focus of Ron's devotional this week. God is our refuge and our strength. When we choose to stand on our own we can lose focus on what God wants for us, but if we put our trust in him we can walk in true righteousness and his love can shine out through us.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%207-15-19.mp3"
    ],
    "Devotionals for 7-8-19": [
        "Mon Jul 08, 2019",
        "Terry talked tonight about the nature of science and God. There is much debate in the world about weather you can believe science and reject God or trust God and reject science. Terry's message teaches us that it's really not one or the other. \nPlease note: We are still working through some audio issues. There was a poor connection but if you do listen, you should be able to understand enough of the message to benefit from it.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%207-8-19.mp3"
    ],
    "Devotionals for 7-1-19": [
        "Mon Jul 01, 2019",
        "Having a plan for things can make us feel comfortable, but God's plan isn't always the same as ours. Mandee's message tonight was about how God leads us through different seasons in our lives and the plan that he has for our lives is truly awesome (even if it can be a little scary at times).",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%207-1-19.mp3"
    ],
    "Devotionals for 6-24-19": [
        "Mon Jun 24, 2019",
        "John was back tonight, bringing a message of encouragement. In his devotional, he talked about the importance of strengthening each other and putting our faith solidly in Christ.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals for 6-24-19.mp3"
    ],
    "Devotionals for 6-17-19": [
        "Mon Jun 17, 2019",
        "Ron talked tonight about the great commission and the calling God has for us. He then shared a wonderful story about a recent experience he had where he was able to be the hands and feet of God. His message tonight serves as a challenge to us to share the love and message of Jesus right in our own communities.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%206-17-19.mp3"
    ],
    "Devotionals for 6-10-19": [
        "Mon Jun 10, 2019",
        "Tonight's message was inspired by Psalm 16 which is a verse about how David found gladness and contentment in pressing times. Using this verse, Brandon highlighted eight different ways we benefit from knowing God.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%206-10-19.mp3"
    ],
    "Devotionals for 6-3-19": [
        "Mon Jun 03, 2019",
        "Terry talked tonight about success. Biblical success to be exact. Nehemiah achieved greatness when he put himself in the right mindset and listened to what God was wanting of him. We also can apply these same lessons to our lives and achieve what God has called us to do. Note: We were having some quality issues with the recording so some of it is a little hard to hear...totally worth listening to though.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%206-3-19.mp3"
    ],
    "Devotionals for 5-20-19": [
        "Mon May 20, 2019",
        "The bread of life. What is it? Ron talked tonight about Jesus's message to the people about seeking food that does not spoil, but endures to eternal life. Just as the Israelites were instructed to gather mana daily for their sustenance, we too are to gather our daily bread of life that is Jesus and his word.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%205-20-19.mp3"
    ],
    "Devotionals for 5-13-19": [
        "Mon May 13, 2019",
        "Terry talked tonight about the importance of the family structure. Supporting and building a strong family (or church) can be of great value to living out the life God intends for us.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%205-13-19.mp3"
    ],
    "Devotionals for 5-6-19": [
        "Mon May 06, 2019",
        "Do you ever feel distant from God? Abandoned? The reason you feel this way might just surprise you. Mandy's message tonight was full of great information about how to recognize barriers that may be keeping you from God and reconnect to him as he intended.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%205-6-19.mp3"
    ],
    "Devotionals for 4-29-19": [
        "Mon Apr 29, 2019",
        "The day Jesus rose from the grave may have been the first time the great message of hope came into application, but it was not the first time this message was shared. John talked tonight about the glorious plan that God had laid out from the beginning and also how God has a perfect plan just for you.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%204-29-19.mp3"
    ],
    "Devotionals for 4-22-19": [
        "Mon Apr 22, 2019",
        "Ron's message tonight was about the resurrection and the life of Jesus. In the days leading up to his crucifixion, Jesus taught some powerful lessons about what was happening at the time as well as what was to come. He both told us as well as showed us that belief in him is more powerful than death on this earth.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%204-22-19.mp3"
    ],
    "Devotionals for 4-15-19": [
        "Mon Apr 15, 2019",
        "Terry titled tonight's message \"Do you have an expectable sacrifice?\". When Jesus laid down his life for us, he took the place of the animal sacrifice in our worship of God but does that mean we don't have to give up or sacrifice anything?  Terry highlights some great points about the nature of sacrifice and what God requires of us today.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%204-15-19.mp3"
    ],
    "Devotionals for 4-8-19": [
        "Mon Apr 08, 2019",
        "John focused tonight the verse from Hebrews 13:5 ... Let your conduct be without covetousness; be content with such things as you have. For He Himself has said, \"I will never leave you nor forsake you.\" In this verse, God lets us know without a shadow of doubt that he loves us and is there for us even when we feel lost or alone.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%204-8-19.mp3"
    ],
    "Devotionals for 4-1-19": [
        "Mon Apr 01, 2019",
        "For tonight's devotional, John broke down some of David's writings from the book of Psalms. In these verses, David asks, who may dwell in God's sacred tent? The answers paint an instructive picture of how God wants us to live our lives.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%204-1-19.mp3"
    ],
    "Devotionals for 3-25-19": [
        "Mon Mar 25, 2019",
        "You should love your God with all your heart, with all your soul and with all your might and you shall love your neighbors as yourself...this was what Jesus said was the greatest of commandments. Ron reflected tonight on what this means for us. He challenged us to question our love for God and also to understand what that means for our roll in his kingdom.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%203-25-19.mp3"
    ],
    "Devotionals for 3-18-19": [
        "Tue Mar 19, 2019",
        "How much can you say you know about the anti-Christ? Terry talked tonight about what we should know about those that oppose God and how we can be on our guard to know the truth from deception.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%203-18-19.mp3"
    ],
    "Devotionals for 3-11-19": [
        "Mon Mar 11, 2019",
        "What does Arnold Schwarzenegger, Lou Ferrigno and Charles Atlas have in common? They were all able to target weak areas in themselves and become stronger through training. John's message has some great incites on how you can bolster weak areas in yourself and strengthen your relationship with God.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%203-11-19.mp3"
    ],
    "Devotionals for 3-4-19": [
        "Mon Mar 04, 2019",
        "The title of John's message tonight was \"What's in your wallet?\". No, he didn't want to see the pictures of your kids, your drivers license or some crinkled dollar bills. He was asking what you're are investing in, here on earth. Using a slightly different take on the sermon on the mount, John shared some great ideas on how we can grow our selves and invest in our heavenly future.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%203-4-19.mp3"
    ],
    "Devotionals for 2-25-19": [
        "Mon Feb 25, 2019",
        "Tonight's message was about abiding in God. All of us struggle with inner conflict and our inability serve Christ perfectly. Ron shared some solid advice about how we can strengthen our walk with God and do better to abide in him.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%202-25-19.mp3"
    ],
    "Devotionals for 2-18-19": [
        "Mon Feb 18, 2019",
        "Terry's message tonight was about God's people and the choice he offers up to us. Much like how Adam and Eve were given a close relationship with God but also offered a choice to obey his word or turn away, we too are endowed with the ability to walk with him or turn from him.\nNote: There is some audio overlap for the last 30 seconds so that bit is a bit hard to hear. Sorry :(",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%202-18-19.mp3"
    ],
    "Devotionals for 2-11-19": [
        "Mon Feb 11, 2019",
        "Jesus spent 40 days in the wilderness without food or water and at the end of it was tempted by satan himself. Did he cave or give into temptation? No he did not. John's message tonight was all about how you too can be empowered by the holy spirit to stand strong against the trials and tribulations of life.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%202-11-19.mp3"
    ],
    "Devotionals for 2-4-19": [
        "Mon Feb 04, 2019",
        "Tonight Terry took us back to a time before the fall. To a place of perfect design and intent. Terry also gave some great insights on the nature of the flood and also just how forgiving and merciful God is to us.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%202-4-19.mp3"
    ],
    "Devotionals for 1-28-19": [
        "Tue Jan 29, 2019",
        "John continued his reading in Psalms tonight which talked about the time David was on the run from his son Absalom. The restraint and trust in God that David showed is a great example to us. Setting aside our own emotions and plans and letting God show us his way, will ensure that we can deal with anything life hands us in the best possible way.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%201-28-19.mp3"
    ],
    "Devotionals for 1-21-19": [
        "Mon Jan 21, 2019",
        "Is it possible to have X-ray faith? Terry discussed the story of Elisha where God had sent an army to protect him but Elisha's attendant couldn't see them. It wasn't until Elisha prayed that his eye's would be open that he finally saw all that was before them. In much the same way, Terry asks us to imagine what it would be like to see the fullness of God's spiritual glory with our own eyes.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%201-21-19.mp3"
    ],
    "Devotionals for 1-14-19": [
        "Mon Jan 14, 2019",
        "John asked us tonight if we felt like we had it all together? It was pretty safe to say to most (all) of us struggle with the day to day but using David as an example, John showed us that if we put our trust in God we can face down anything life throws at us.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%201-14-19.mp3"
    ],
    "Devotionals for 1-7-19": [
        "Mon Jan 07, 2019",
        "Would you consider yourself a slave? Terry talked tonight about what being a slave in todays world means and the difference between being a slave to sin or a slave to righteousness.",
        "https://renewedhope.blob.core.windows.net/devotionals/Devotionals%20for%201-7-19.mp3"
    ],
    "Devotionals for 12-17-18": [
        "Mon Dec 17, 2018",
        "In this last devotional before Christmas, John talked tonight about the greatest gift this world has ever received. Jesus was chosen before the creation of the world to be our gift of salvation. A gift that we have neither earned nor deserve, yet one that bridges the gap between us and our awesome God.\nHave a very Merry Christmas everyone!",
        "https://drive.google.com/open?id=1IsYsLtXTH80-VRwSuPQ7R1sDFxtWfOy1"
    ],
    "Devotionals for 12-10-18": [
        "Mon Dec 10, 2018",
        "How my Christmas myths do you have under your tree? Terry talked tonight about some of the common myths that we here about Christmas and also some of the truths.",
        "https://drive.google.com/open?id=1roXuoEX5PnVqaFCZi7-5eISg-7vtlTkM"
    ],
    "Devotionals for 12-3-18": [
        "Mon Dec 03, 2018",
        "Do you ever feel like things aren't going your way and maybe your life could use a backup plan? Do you ever feel forsaken by God? John's message tonight reminds us that no matter what's going on, we always fit perfectly in to the plan God has for us.",
        "https://drive.google.com/open?id=1G66ezBHiVOcXq0-pkXjpeSLl-P0BR8J7"
    ],
    "Devotionals for 11-26-18": [
        "Mon Nov 26, 2018",
        "When Paul was bitten by a snake in Malta, he amazed the people there by simply shaking the creature off into the fire. Terry's message tonight used the lowly snake as a metaphor for unhealthy things in our lives that we should also \"shake off\".",
        "https://drive.google.com/open?id=1vMmAraTPd9rghq_7m9Rql2IZ04qDJiuA"
    ],
    "Devotionals for 11-19-18": [
        "Mon Nov 19, 2018",
        "Terry talked tonight about leadership and following God's calling. By exploring some of the leadership skills that are displayed by people in the Bible we can learn valuable lessons that will help us fulfill God's calling for us.",
        "https://drive.google.com/open?id=1F2I0BHDXtrqXXoOG0dYrAK8w8OPPKokW"
    ],
    "Devotionals for 11-12-18": [
        "Mon Nov 12, 2018",
        "Are you feeling down or just frustrated a lot? Want a surefire way to make most everything in your life feel a little better? John shared a great message tonight about the joy of giving thanks. When we focus on the blessings God provides us (even if it's something simple) we will not only be shifting our focus from the negative in our lives but also it reminds us of God's constant presences and love for us.",
        "https://drive.google.com/open?id=1t0AGsoCnent_mXzeUgtP892QDHChnFiO"
    ],
    "Devotionals for 11-5-18": [
        "Mon Nov 05, 2018",
        "Terry talked tonight about the call of biblical leadership. The Bible is full of regular people who rose up to be great leaders, many of whom were flawed and reluctant to lead. The message tonight was encouraging and a great reminder of what God can do in our lives.\n***I goofed up the recording tonight so there is a lot of creaking, tinking and shuffling going on in the background (it recorded my webcam mic of all things). My apologies. You can still hear the message, there is just quite a bit of distraction to ignore. Sorry all.",
        "https://drive.google.com/open?id=1x6Rz0Wug-8mNCM_PbErSYvNmeR85naDU"
    ],
    "Devotionals for 10-29-18": [
        "Mon Oct 29, 2018",
        "John shared a cute story tonight that illustrated how important involvement with others can be. He also shared some practical tips on reaching out and showing love to others. Jesus commanded us to love one another and tonight's message aims to help you do just that.",
        "https://drive.google.com/open?id=1H7EXgBQOh08zH8s6XNs2ITFzmqUPOG-k"
    ],
    "Devotionals for 10-22-18": [
        "Mon Oct 22, 2018",
        "1 Timothy 4:1-5 talks about doctrines of demons. This may sound like an unnerving topic, but Terry explained just what this means and how it can be a snare to our spiritual lives. By understand just what this text is referring to we can be sure that we are following Jesus's example of putting God first and not succumbing to fallacies of this world.",
        "https://drive.google.com/open?id=1cJUzyCLhujGHPe7MYNDJ9qjtAIVnnX6D"
    ],
    "Devotionals for 10-15-18": [
        "Mon Oct 15, 2018",
        "The bible is full of interesting characters. One got things right but the rest all had their flaws. John talked tonight about how we can relate to many of these biblical figures and also how God can do amazing work in our lives, despite our faults and imperfections.",
        "https://drive.google.com/open?id=18ARn6xmG8rYoJ8RoKsQiS3mQNgPktPTr"
    ],
    "Devotionals for 10-8-18": [
        "Mon Oct 08, 2018",
        "The story of Shadrach Meshach and Abednego is one that has so much going on that you can almost forget all of the great lessons we can learn from it. Standing strong in our faith, God's truth being revealed to those who doubt and (as in the message tonight) God standing with us through our trials. Even as Christian's we will face trials and tribulations throughout our lives but with God at our side we will surly see the better side of these struggles.",
        "https://drive.google.com/open?id=1qPU8DgM61xX1UqYtzp0fyPO3iA0DXbya"
    ],
    "Devotionals for 10-1-18": [
        "Mon Oct 01, 2018",
        "Terry talked tonight about the trials of Job and how God held him up as an example of someone strong in faith. \"Have you considered my servant Job?\" were the words God used to tell the devil (and us through the story) that Job was a man worthy of being called out by name. Terry invites us tonight to live a life of truth, worthy of being an example for Christ.",
        "https://drive.google.com/open?id=1FPxuXR0gmOApG7XQC4nisegvq9jQ83gW"
    ],
    "Devotionals for 9-24-18": [
        "Mon Sep 24, 2018",
        "David talked tonight about the time God sent Micah to call Israel out for straying far from his ways. When the people acknowledged their sin and asked what they needed to do to get back in his graces, God surprised them with just how simple it is. Just as we stray from his path he invites us back into his loving arms. Not after we clean up or fix our selves first. Right here, right now.",
        "https://drive.google.com/open?id=1earf3pUAGqDlntlS4ntHdzNVWR9xw5L2"
    ],
    "Devotionals for 9-17-18": [
        "Mon Sep 17, 2018",
        "John's message tonight was about joy and contentment. He shared some great illustrations that helped to remind us that when we base our joy on the Lord, we will find the lasting contentment they we all seek in our lives.",
        "https://drive.google.com/open?id=1pMuvxNAiggGBiZfMMO0-mI6jtH1f9nZd"
    ],
    "Devotionals for 9-10-18": [
        "Mon Sep 10, 2018",
        "Terry brought the message tonight and it was all about defending the word of God. Apologetics is defined as: reasoned arguments or writings in justification of something, typically a theory or religious doctrine. Using this approach Terry talked about the importance of knowing God's word and being able to share it with others.",
        "https://drive.google.com/open?id=129KN7oZKk7JL-oO6wvDMb7GJSndjzlgC"
    ],
    "Devotionals for 8-27-18": [
        "Mon Aug 27, 2018",
        "If I could put my own title on tonight's devotional it would be \"God loves you fiercely\". John brought an uplifting message tonight about the love that God has for us. Through story and example John reminded us how we are loved and that we should also share that love with others.",
        "https://drive.google.com/open?id=1d4WtMh3WuXvOx5-suyZHDIqsXAGZrKke"
    ],
    "Devotionals for 8-20-18": [
        "Mon Aug 20, 2018",
        "Stress is never a good thing, right? Well, not so fast. Terry brought a message tonight about how God can use stress to our benefit. He also talked about ways we can reduce stress by drawing ourselves closer to God.",
        "https://drive.google.com/open?id=1C2OaNSPgQqnHnz5N4zbz95NtBAp1I7Ss"
    ],
    "Devotionals for 8-13-18": [
        "Mon Aug 13, 2018",
        "John shared another great message tonight, this one centered around hope. John's message covered many different aspects of hope and there where many practical things to focus on this week.",
        "https://drive.google.com/open?id=1E_I8op7vx9whDC0uWV5gYpVWgjTdTK1X"
    ],
    "Devotionals for 8-6-18": [
        "Mon Aug 06, 2018",
        "David asked us tonight \"Who owns you?\". Starting with the sermon on the mount, David explored several topics relating to how we use the gifts that God has given us. This was a challenging message and one the I absolutely needed to hear.",
        "https://drive.google.com/open?id=16P9QAHiM-muJU1OPuSly6co5bGzbb3MX"
    ],
    "Devotionals for 7-23-18": [
        "Mon Jul 23, 2018",
        "John's message tonight was a continuation of his \"Jesus is enough\" devotional. While discussing the letters Paul was writing from prison, John makes some great points about how our behaviour can alienate us from God. Thankfully, Jesus is there as our path to reconciliation to the Almighty.",
        "https://drive.google.com/open?id=1cjDV-UdaEauhkdFkyj76AA9meUjoWvfb"
    ],
    "Devotionals for 7-16-18": [
        "Mon Jul 16, 2018",
        "Matthew 18:2-4  He called a little child to him, and placed the child among them. And he said: \"Truly I tell you, unless you change and become like little children, you will never enter the kingdom of heaven. Therefore, whoever takes the lowly position of this child is the greatest in the kingdom of heaven.This teaching of humbleness was the center piece of tonight's devotional. David taught us tonight how this radical, yet powerful instruction is key to our eternal walk with God.",
        "https://drive.google.com/open?id=1USUcuVxksVe3DQeFRIFZLD1MyxNmdP_L"
    ],
    "Devotionals for 7-9-18": [
        "Mon Jul 09, 2018",
        "For tonight's devotional John continued his message of \"Jesus is enough\". As we studied Paul's writings from prison we can gain a clear understanding of how completely God will provide for us, even during our most difficult times. This also serves as a great reminder to always keep God as our primary focus.",
        "https://drive.google.com/open?id=1lf-F-9HgXHVnGp82UuT3Kbeh-SNoopgo"
    ],
    "Devotionals for 7-2-18": [
        "Mon Jul 02, 2018",
        "Jesus is enough. This was the topic for tonight's devotional. John's message tonight centered around the early church and how they were reverting to their old customs and teachings. They (like us sometimes) did not fully acknowledge that the grace given through Jesus Christ was enough for their lives.",
        "https://drive.google.com/open?id=1lc5hHfUeFhY-l7f8fGj6rJX27-b_9xLK"
    ],
    "Devotionals for 6-25-18": [
        "Mon Jun 25, 2018",
        "Many (if not all) people struggle with thoughts that can be dark and even harmful to our relationship with God. Often times we can feel powerless to control what we are thinking and feeling. Terry talked tonight about taking control of your thoughts and emotions. His message was about empowering us to overcome the darkness that can sometimes surround and invade us.",
        "https://drive.google.com/open?id=1sIIL93pJpGPn70_V48sIGvzHs1p6Jv--"
    ],
    "Devotionals for 6-18-18": [
        "Mon Jun 18, 2018",
        "Perspective was the topic of tonight's devotionals. Many things in life happen to us that we have little to no control over. The one thing we do have control over is our perspective. How we view our circumstances can be the difference between a bad situation and an uplifting one.",
        "https://drive.google.com/open?id=1nGY9LRiEcKkFGZQ3XdRnaK7SnyXgsyJv"
    ],
    "Devotionals for 6-11-18": [
        "Mon Jun 11, 2018",
        "What does being lead by God look like? Where will he take you if you decide to follow in his foot steps? Tonight David's message focused on God's guidance and path for us.",
        "https://drive.google.com/open?id=1gqHf8U4sYs6sl_dv6niN9DSaAgAqqkkj"
    ],
    "Devotionals for 6-4-18": [
        "Mon Jun 04, 2018",
        "Do you find it difficult to talk to people about Jesus? Do you feel like you should be spreading the word of God but you're just not sure about the best way to go about doing it? Well your in luck :D John's message tonight was a no-nonsense approach to getting yourself prepared and getting out there for Jesus.",
        "https://drive.google.com/open?id=19Baj8uvHSKtY6AZ-8ZioigYDshKq5Wo3"
    ],
    "Devotionals for 5-21-18": [
        "Mon May 21, 2018",
        "Ambition is a good thing, right? It's a prized trait in modern society. Something to be admired and rewarded for having. Now what about those ambitious folks from Babel? Would you say their ambition was a good thing? John's message tonight talks about the different between being ambitious for our own benefit and being ambitious for God.",
        "https://drive.google.com/open?id=1tOn1biVbb4pNX2g5Ew2ziQFKPP4LAt9D"
    ],
    "Devotionals for 5-14-18": [
        "Mon May 14, 2018",
        "What should we do when we are waiting on God to answer our prayers? Should we sit around passively hoping he will come through for us? Should we take matters into our own hands and try our own plans to work things out? David talked tonight about how to be an expectant waiter and just as importantly, how to refrain from acting outside of God's will.",
        "https://drive.google.com/open?id=1mTwzWP-Zl_kglViuNP-X7wFJRd_gAQRx"
    ],
    "Devotionals for 5-7-18": [
        "Mon May 07, 2018",
        "John shared an excellent message tonight about being called. Many of us may feel the calling to serve the Lord but would rather he make us just a little better before we can get started. John explains that no matter who you are or where you are in life, God can use you (flaws and all) for his great work.",
        "https://drive.google.com/open?id=1gCSAILVwCugPwbMfidcQ1na152gDyf3A"
    ],
    "Devotionals for 4-30-18": [
        "Mon Apr 30, 2018",
        "What does it mean to be free? Does that mean we can just do whatever we want whenever we want to? David gives a great explanation tonight about how following our earthly desires may feel like freedom but in actuality may be just the opposite.",
        "https://drive.google.com/open?id=120oOHTrcRGjuJvaHgqF8QGUeIRa4tTAN"
    ],
    "Devotionals for 4-23-18": [
        "Mon Apr 23, 2018",
        "We all have important dates that we keep for remembrance or celebration. The reason these dates are important to us varies but whatever the reason, it is something that has great significance in our lives. John's message tonight is talks about one of the most momentous days that has ever happened in this world, the day that Jesus defeated death and rose from the grave.",
        "https://drive.google.com/open?id=1QGj4levcen6BcRo4_NvGJglLqtdhbb4f"
    ],
    "Devotionals for 4-16-18": [
        "Mon Apr 16, 2018",
        "I'll bet most of us have missed out on opportunities to pray for someone or share God's word because we didn't feel bold enough.  David's message tonight was all about how boldness is not so much a feeling but a willingness to act. He shared some great advice tonight on how to convey what God has done in your life to others.",
        "https://drive.google.com/file/d/1gfHmw5dJ7Oxk61SMFOcIOpcsghLjCwga/view?usp=sharing"
    ],
    "Devotionals for 4-9-18": [
        "Mon Apr 09, 2018",
        "John's message tonight hit on many great points. Quoting Solomon \"Now all has been heard and here is the conclusion of the matter, fear God and follow his commandments, for this is the duty of all mankind\". As instructed, we are to seek knowledge, fear and follow God. This is the essence of all true wisdom.",
        "https://drive.google.com/open?id=1jILOY4-7PUkee6PLvFyL4xLOkrYiDiJH"
    ],
    "Devotionals for 4-2-18": [
        "Tue Apr 03, 2018",
        "Psalm 23 is a popular verse to read at funerals and for good reason. It speaks to comfort, care and the promise of eternity with Jesus. Johns message talks about how these words should be shared always as they apply to our lives now as well as our lives to come.",
        "https://drive.google.com/open?id=1reJOlwGqqneCuppb06c41M-eNjiWM0uf"
    ],
    "Devotionals for 3-26-18": [
        "Mon Mar 26, 2018",
        "Terry shared a message tonight of both hope and caution. The enemy wants nothing more than to keep you down and he will use our own weaknesses to bring that about. Terry used the story of Samson to illustrate that no matter how down and hopeless we feel, God is there to lift us up with his almighty power.",
        "https://drive.google.com/open?id=1ACykHHVQmh4bVKPWQWrSNzvFUBDfv8R0"
    ],
    "Devotionals for 3-19-18": [
        "Mon Mar 19, 2018",
        "Do you feel like you might be missing out on a closer relationship with God because you a just too busy with life? David talked tonight about the importance of slowing down and spending some undistracted time with the Lord.",
        "https://drive.google.com/open?id=1HxsGLOAbVc41i1e1MXG9UXyC1pKrnsjZ"
    ],
    "Devotionals for 3-12-18": [
        "Mon Mar 12, 2018",
        "Do you miss the good old days? Ever find yourself complaining because things don't seem to be as good as they used to? John talked tonight about remembering all the wonderful things that God does in our lives and how his plan for us is for our great benefit.",
        "https://drive.google.com/file/d/16ixko15tHwXdcWa_NexpLXSkMq7Ylz0X/view?usp=sharing"
    ],
    "Devotionals for 3-5-18": [
        "Mon Mar 05, 2018",
        "David's message tonight was about community. Gathering together as a church or small group can both strengthen and support us. David reminds us that God loves to see his people come together to build each other up with faith and love.",
        "https://drive.google.com/open?id=19uNSUAeBMjemFi2BCNUR0rpQQ4wWjZx0"
    ],
    "Devotionals for 2-26-18": [
        "Wed Feb 28, 2018",
        "Do you consider your self a leader? Have you ever thought about how your actions may lead someone to (or maybe away from) Christ? John's message tonight was about being a good leader through both actions as well as words.",
        "https://drive.google.com/open?id=1GHe9xJJDonoZiMtb4I4NQ6MypCCbKK3T"
    ],
    "Devotionals for 2-19-18": [
        "Mon Feb 19, 2018",
        "Tonight David challenged the notion that God loves everyone the same. Everyone is unique and God loves us uniquely. Understanding this simple but profound truth can have a powerful impact on our relationship with him.\n* We lost the last minute or so of audio but the main points are all there.",
        "https://drive.google.com/open?id=10FFpsaL4pNux89V-W3yWs9RUifZJsA1k"
    ],
    "Devotionals for 2-12-18": [
        "Mon Feb 12, 2018",
        "Terry talked tonight about the story of Gideon and how God instructed him before the battle against the Midianites, Amalekites and other eastern peoples. God told Gideon to pare down his army to a mere 300 soldiers, but why? Terry explains how being prideful and self centeredness can be destructive and is the work of the great deceiver.",
        "https://drive.google.com/file/d/1NDGRBmUIPDglMNApnQka7sF3eg5tdNbb/view?usp=sharing"
    ],
    "Devotionals for 2-5-18": [
        "Mon Feb 05, 2018",
        "John shared more lessons tonight from Solomon's observations. Why does the world seem so unfair? What should we value in this life? Many questions were asked in this devotional and many insightful answers were given.",
        "https://drive.google.com/open?id=1BwI8INLq2sDibEEJKuW50OKNWe7v3mq5"
    ],
    "Devotionals for 1-29-18": [
        "Mon Jan 29, 2018",
        "How do you gauge your worth? Do you know what your worth is? David explains that understanding just how valuable you are can ensure that you don't under value yourself and trade away what is precious to God for the worthless things of this world.",
        "https://drive.google.com/file/d/1VIURrprRk11_wY--njEAIcPu7WjQYnej/view?usp=sharing"
    ],
    "Devotionals for 1-22-18": [
        "Mon Jan 22, 2018",
        "John covered a range of topics tonight in our devotional. He talked about what it means to fear God, enjoying life and even the search for knowledge. There were lots of great points here to ponder.",
        "https://drive.google.com/file/d/1q5wvnd7wPuZy6QW9TLPQsNXKNdbse5uk/view?usp=sharing"
    ],
    "Devotionals for 1-15-18": [
        "Mon Jan 15, 2018",
        "One of the more powerful gifts that God gives us in this life is hope. Hope can help see us through some of the darkest and most difficult times in our lives. It can strengthen us and at the same time calm our fears. David talked tonight about this wonderful gift we have been given through God.",
        "https://drive.google.com/file/d/1EBvXBZrxwA8mt4R3OQuP1DxcAE_tEdAi/view?usp=sharing"
    ],
    "Devotionals for 1-8-18": [
        "Mon Jan 08, 2018",
        "John's message tonight was about encouragement. By encouraging each other we not only Glorify God but also shift our focus away from our own struggles and see God's light shine out all the brighter.",
        "https://drive.google.com/file/d/1iiD7kgV9zWVPIfYiIdmzDGGs8yMzRXwb/view?usp=sharing"
    ],
    "Devotionals for 12-18-17": [
        "Mon Dec 18, 2017",
        "With Christmas right around the corner John continued his discussion about the birth of Christ. This event is one of the greatest moments in the history of the world and while nearly all of us have heard the story, John lists out several things to ponder that we could all benefit from hearing.Please note: We will not be holding devotionals for the next two weeks for the holidays. Have a very merry Christmas and a safe new year everyone!",
        "https://drive.google.com/file/d/15-HDS7yYDpyF-bznadKcpNbDz5MtYSig/view?usp=sharing"
    ],
    "Devotionals for 12-11-17": [
        "Mon Dec 11, 2017",
        "Eye's on the prize is one of my favorite sayings when times get tough. David's message tonight was all about the prize. Heaven isn't talked about nearly enough and we can often forget what glorious things we have to look forward to. David cornicles many of the great things we can expect to see as well as all the pain and struggles that we will gladly leave behind.",
        "https://drive.google.com/file/d/19TfYAzIK9kSYcsYHxg9XuSfpBrkQUysf/view?usp=sharing"
    ],
    "Devotionals for 12-4-17": [
        "Thu Dec 07, 2017",
        "John took a step back from his study of Ecclesiastes to walk us through a series of verses talking about the greatest gift the world has ever been given, the birth of Christ. The joy and excitement that came from this wonderful event is wonderfully described in these scriptures. Here are the verses that were shared: 1.\t John 1:1-5 2.\t Isaiah 9:2-7 3.\t Isaiah 11:1-10 4.\t Jeremiah 33:14-16 5.\t Luke 1:5-10 6.\t Luke 1:11-17 7.\t Luke 1:18-25 8.\t Luke 1:26-38 9.\t Matt 1:18-21 10.\t Matt 1:22-26 11.\t Luke 1:39-45 12.\t Luke 1:46-56 13.\t Luke 2:1-5 14.\t Luke 2:6-7 15.\t Luke 2:8-12 16.\t Luke 2:13-14 17.\t Luke\t 2:15-18 18.\t Luke 2:19-20 19.\t Micah 5:2-5 20.\t Matt 2:1-2 21.\t Matt 2:3-6 22.\t Matt 2:7-8 23.\t Matt 2:9-12 24.\t John 1:14",
        "https://drive.google.com/file/d/1CDfqkEAo4uJ6nNN4vjv0TkMcPUxb1xQq/view?usp=sharing"
    ],
    "Devotionals for 11-28-17": [
        "Tue Nov 28, 2017",
        "Brandon finished up the second part of his two part series asking what would it be like if we actually did what was written in the bible. There are so many great lessons we can learn from scripture. Brandon focused tonight on priorities and how we can structure our lives in a way that is pleasing to God.",
        "https://drive.google.com/file/d/193TuYVE0Ia5nNzOvkOkvsoWMBMNiGtDg/view?usp=sharing"
    ],
    "Devotionals for 11-20-17": [
        "Mon Nov 20, 2017",
        "John has titled tonight's message, \"Let go and let God\". Giving things over to God can be a struggle for many of us. John draws from his own experience and well as teachings of Solomon to encourage us to lean on God and let him guide us in our lives.",
        "https://drive.google.com/file/d/1pX8JeKz9sbCXyIdWPHDNaGC2CtMxCQ-6/view?usp=sharing"
    ],
    "Devotionals for 11-13-17": [
        "Mon Nov 13, 2017",
        "Is it better to sew or to reap? Following God's path can bring us to one of these actions or the other, but John explains what value God places on these complimentary actions.",
        "https://drive.google.com/file/d/1iaOOcBDjdxnoaDSdXoui7wnJjV8bx3kM/view?usp=sharing"
    ],
    "Devotionals for 11-6-17": [
        "Mon Nov 06, 2017",
        "David shared an impassioned message tonight dealing with the suffering in this world. For anyone struggling with the \"why?\" factor in the face of tragedy, David's message will be a comfort.",
        "https://drive.google.com/file/d/1TKAE8eYO233Oiz45h9UxSM1-SKffY6Y4/view?usp=sharing"
    ],
    "Devotionals for 10-30-17": [
        "Mon Oct 30, 2017",
        "John has a question for you this week. What do you take pleasure in? It seems like a simply question but the answer can mean the difference between emptiness and true happiness.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSa3l5WWoxUXBlR0U/view?usp=sharing"
    ],
    "Devotionals for 10-23-17": [
        "Mon Oct 23, 2017",
        "Brandon started the first of his two part series asking what would it be like if we actually did what was written in the bible. The bible if full of great teaching on how we should live out lives but are we actually following those teachings? Brandon highlights some great, actionable things that we can do to walk the path God has laid out for us.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSdFZOcEJXdnBSTkU/view?usp=sharing"
    ],
    "Devotionals for 10-16-17": [
        "Mon Oct 16, 2017",
        "John has titled his devotional tonight \"The pursuit of happiness.\" The world will tell you happiness can be found here, there and everywhere, but true happiness can only be found in one place. In the loving arms of our Lord.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSRjlNWm9pOGo3VGM/view?usp=sharing"
    ],
    "Devotionals for 10-9-17": [
        "Mon Oct 09, 2017",
        "Faith. What it is and what it isn't was David's message tonight.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSRURCZldEWmxla00/view?usp=sharing"
    ],
    "Devotionals for 10-2-17": [
        "Mon Oct 02, 2017",
        "Brandon returns tonight to give a message he titled \"Waiting for Victory\". His message centers around Isaiah's teachings on what is wrong with the world today but also what we have to look forward to.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSekdEOTljY2RFWGM/view?usp=sharing"
    ],
    "Devotionals for 9-25-17": [
        "Tue Sep 26, 2017",
        "Happiness and Joy. Are they the same thing? David's message tonight clearly spells out the difference between the two and which one we should be seeking for our lives.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSRkdrZzdjZ3lROE0/view?usp=sharing"
    ],
    "Devotionals for 9-18-17": [
        "Tue Sep 26, 2017",
        "John's message tonight centered around King Solomon and what he said about what the world values. Solomon was renowned for his wisdom and he rightly points out what is truly important in this life.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSbXYwN1ZBRUpDams/view?usp=sharing"
    ],
    "Devotionals for 9-11-17": [
        "Mon Sep 11, 2017",
        "One of the greatest messages of hope ever delivered comes to us from Revelation 21:1-8. John shared this message with us tonight detailing the glorious plans God has for us.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSbXphS1lMV1h1M28/view?usp=sharing"
    ],
    "Devotionals for 8-28-17": [
        "Mon Aug 28, 2017",
        "You salty bro? Well maybe you should be. David's devotional tonight was about how we can and should be salt of the earth.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSQ2d1ZldXX3EyUjA/view?usp=sharing"
    ],
    "Devotionals for 8-21-17": [
        "Mon Aug 21, 2017",
        "Who was Shamgar? The bible records him delivering Israel from the Philistines but not much else is written. Was he an ordinary man, a trained assassin or an obsessed person with the willingness and desire to follow God's calling. Johns message tonight explores who Shamgar was as well as what we can learn from his example.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSU3M0TXZhOEVNczA/view?usp=sharing"
    ],
    "Devotionals for 8-7-17": [
        "Mon Aug 07, 2017",
        "John used the story of Ehud to talk about two important topics, being ready to answer God's call and avoiding the sin/repent/sin cycle. Both can be accomplished by spending time in God's word.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSVGszUEVZcE4td00/view?usp=sharing"
    ],
    "Devotionals for 7-31-17": [
        "Mon Jul 31, 2017",
        "David's topic of the night was about identity. God gives us an identity as talked about in 1 Peter 2:9 But ye are a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of him who hath called you out of darkness into his marvellous light.  We may feel disconnected or cut off from Christ but if you are willing to put your past aside and seek and encounter with Him, you will come to know your real identity in Christ.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSZVV2cG1IVXRKeGM/view?usp=sharing"
    ],
    "Devotionals for 7-24-17": [
        "Mon Jul 24, 2017",
        "Brandon's message was about the prayer we are taught to pray in Matthew. The Lord's prayer is instructive and gives us a great example of how to talk to God.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSMnoxRlNCZWcycFk/view?usp=sharing"
    ],
    "Devotionals for 7-17-17": [
        "Mon Jul 17, 2017",
        "David's message tonight was about obedience to God. He made some great points about what happens when we ignore warnings God has given us and also what its like to follow God's leading even when it seems difficult.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSUkNoUTJRYURFWEU/view?usp=sharing"
    ],
    "Devotionals for 7-10-17": [
        "Mon Jul 10, 2017",
        "Johns message tonight centered around the story of Elisha and Naaman. There were many great take aways from this story and John did an awesome job of sharing the deeper meaning of it all.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSb1IybEJJTlJnOVU/view?usp=sharing"
    ],
    "Devotionals for 6-26-17": [
        "Mon Jun 26, 2017",
        "John shared a great message tonight about how sin can take root in your life. Using Judas as an example, he talked about how letting sin in to your life can corrupt even a direct disciple of Jesus.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSVjM0MFduOHBRMlk/view?usp=sharing"
    ],
    "Devotionals for 6-12-16": [
        "Mon Jun 12, 2017",
        "With his wedding quickly approaching, Brandon shared a personal message tonight about..well, marriage. Understanding marriage in the way that God would want it for us is important both to the success of a marriage and also as a way of honoring a blessing given to us.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwScDlZWHA3ajZ0V00/view?usp=sharing"
    ],
    "Devotionals for 6-5-16": [
        "Mon Jun 05, 2017",
        "David's message tonight focused on what the Holy Spirit does in all of us. This was a great mix of church history and uplifting stories. Definitely worth a listen.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSY3FCTmQyRWwyU3M/view?usp=sharing"
    ],
    "Devotionals for 5-22-17": [
        "Mon May 22, 2017",
        "Brandon shared a message tonight about standing firm with our eyes on the king. He shared four biblical truths that can strengthen us in our walk with God.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSLWMtRzFDZklJcmM/view?usp=sharing"
    ],
    "Devotionals for 5-15-17": [
        "Mon May 15, 2017",
        "David's message tonight was about being a doer, not just a listener. James 1:22-25 \"Do not merely listen to the word, and so deceive yourselves. Do what it says.  Anyone who listens to the word but does not do what it says is like someone who looks at his face in a mirror and, after looking at himself, goes away and immediately forgets what he looks like. But whoever looks intently into the perfect law that gives freedom, and continues in it, not forgetting what they have heard, but doing it, they will be blessed in what they do.\"",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSNUh0UXBxRnIyR0U/view?usp=sharing"
    ],
    "Devotionals for 5-1-17": [
        "Mon May 01, 2017",
        "David talked tonight about all of the awesome that is the bible. God's word to us is the most amazing book ever written on so many levels. David shared many interesting facts relating to the bible and explained it's importance for our lives.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSMWZ3dlBOUmhIMlE/view?usp=sharing"
    ],
    "Devotionals for 4-24-17": [
        "Mon Apr 24, 2017",
        "Tony's message tonight was about community. Everyone who is able should attend a church but is that enough? In many ways we can find strength, understanding and growth by also joining together in small groups such as ours.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSRFM2dmp6QzVTdWM/view?usp=sharing"
    ],
    "Devotionals for 4-17-17": [
        "Mon Apr 17, 2017",
        "David shared a passionate message tonight about the atonement.  He talked about the many different facets of the atonement and what they mean for us.\nPlease note:David shared a story during his message that has some harsh language. If you would like to avoid hearing that part, I have two versions of the audio. The first link is the complete message and the second link is edited down.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSMzFoemxYV05oc0k/view?usp=sharing"
    ],
    "Devotionals for 4-10-17": [
        "Mon Apr 10, 2017",
        "Is being a Christian hard or easy? Didn't Christ do all the hard stuff for us already? Tony gave us some great insights tonight on our roll as Christians.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSUHdwcUVtSnUzeUE/view?usp=sharing"
    ],
    "Devotionals for 4-3-17": [
        "Mon Apr 03, 2017",
        "David's message tonight was about commitment. Without real commitment, we often find ourselves slacking on things that we need to do or giving up too soon when we know we shouldn't. David showed us what real commitment looks like and how important it is to be truly committed to God.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSLWxBRWJvYllLQnc/view?usp=sharing"
    ],
    "Devotionals for 3-27-17": [
        "Mon Mar 27, 2017",
        "Tony's devotion tonight was a call to strengthen our faith. His message centered around Matthew 17:19 Then the disciples came to Jesus privately and said, \"Why could we not cast it out?\" 20 So Jesus said to them, \"Because of your unbelief; for assuredly, I say to you, if you have faith as a mustard seed, you will say to this mountain, \"Move from here to there,\" and it will move; and nothing will be impossible for you.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSbWhhakVSQ1FqWjA/view?usp=sharing"
    ],
    "Devotionals for 3-20-17": [
        "Mon Mar 20, 2017",
        "Have you ever ignored a warning and later wished you hadn't? I'm pretty sure that describes most all of us. David's message was all about looking for and then heeding the warning God puts in our lives.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSQURyTExPOGxHcjA/view?usp=sharing"
    ],
    "Alternative devotional message for 3-13-17": [
        "Mon Mar 13, 2017",
        "We skipped devotionals for this week but one of our own, Kevin Huntsinger shared a sermon he did at his church this Sunday. Please enjoy this awesome message.",
        "http://www.familylifecc.tv/podcast/the-presence-of-worship/"
    ],
    "Devotionals for 3-6-17": [
        "Mon Mar 06, 2017",
        "Do you ever feel a little lost between where you were and where you want to be? It's easy to get caught up in the distractions of life and lose track of where we are going. David used the story of Nehemiah to show us what great things can happen if we keep our focus on God's will for us.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwScTNfcEVrZkNzVmM/view?usp=sharing"
    ],
    "Devotionals for 2-27-17": [
        "Mon Feb 27, 2017",
        "Grace was on Tony's mind tonight as he shared a wonderful experience he had recently. The grace he experienced from someone gave him a mere glimpse of how great God's grace is to us.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSS1VNc19lR1ZXRjQ/view?usp=sharing"
    ],
    "Devotionals for 2-20-17": [
        "Mon Feb 20, 2017",
        "David shared a message tonight about bitterness. The bible warns us about the destructive nature of bitterness and how it will hurt ourselves more than those we are bitter with.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSYTd1ZWRLNHdxMDA/view?usp=sharing"
    ],
    "Devotionals for 2-13-17": [
        "Mon Feb 13, 2017",
        "Tony talked tonight about the story of shadrach, meshach and abednego. Their faith and certainty in deliverance by God is something that we should all emulate and draw strength from.  No matter your trial in life, know that God loves you and is with you always.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSQzYyX1lDbTNrdnM/view?usp=sharing"
    ],
    "Devotionals for 2-6-17": [
        "Mon Feb 06, 2017",
        "Brandon shared a great message tonight about God the shepherd. He used a verse that most have heard but few have studied in depth. When broken down, this verse shows both the love that God has for us as well as the great need we all have to truly make him our shepherd. Psalm 23 The Lord is my shepherd; I shall not want.He makes me lie down in green pastures. He leads me beside still waters.He restores my soul. He leads me in paths of righteousness for his name's sake.Even though I walk through the valley of the shadow of death, I will fear no evil, for you are with me; your rod and your staff, they comfort me.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSTDY1Q25qSVdtM1E/view?usp=sharing"
    ],
    "Devotionals for 1-30-17": [
        "Mon Jan 30, 2017",
        "Tony's message tonight was about God's roll as the perfect father. He explained that although God is a righteous God, he is also a loving God.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwScXliY1AzYUlRb2M/view?usp=sharing"
    ],
    "Devotionals for 1-23-17": [
        "Mon Jan 23, 2017",
        "Rest was the topic of David's message tonight. There's an old saying that goes \"If the devil can't make you bad, he'll make you busy.\" Learning to rest in God is what we need as people and yet sometimes it's the last thing we think to do. Hebrews 49 There remaineth therefore a rest to the people of God.10 For he that is entered into his rest, he also hath ceased from his own works, as God did from his.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSZ0tmTC0yaWUtaGM/view?usp=sharing"
    ],
    "Devotionals for 1-16-17": [
        "Mon Jan 16, 2017",
        "Tony's message was once again right on topic. A couple of us were having a conversation only moments before that this message spoke directly to. And what was the message for tonight? Hope. Proverbs 13:12 Hope deferred maketh the heart sick: but when the desire cometh, it is a tree of life.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSOE9KOHZFVlZmZFk/view?usp=sharing"
    ],
    "Devotionals for 1-9-17": [
        "Mon Jan 09, 2017",
        "David's message this week centered around the power and magnitude of God's words to us in Jeremiah.33 But this shall be the covenant that I will make with the house of Israel; After those days, saith the Lord, I will put my law in their inward parts, and write it in their hearts; and will be their God, and they shall be my people.It's easy to lose sight of just how amazing our relationship with God can be and this was a great reminder of what we truly have in the Lord.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSaFJmc2ZOOERTS0E/view?usp=sharing"
    ],
    "Devotionals for 12-19-16": [
        "Tue Dec 20, 2016",
        "Tony asked a simple but profound question tonight. Why do we do this? Why do we follow Christ? His answers are both touching and important. Check out the audio link below for the full message.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSZzZLZ2d3Z1FWVGs/view?usp=sharing"
    ],
    "Devotionals for 12-12-16": [
        "Mon Dec 12, 2016",
        "It's commonly accepted by most people that jealousy is a bad thing. So why then does God describe himself as a \"Jealous\" God? David talks tonight about the difference between the selfish jealousy felt by man and the righteous jealousy that God has for our good.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%20for%2012-12-16.mp3"
    ],
    "Devotionals for 11-28-16": [
        "Mon Nov 28, 2016",
        "Growth is the topic for tonight's message. David made a great analogy tonight between what an infant needs to grow and our own needs as followers of Christ. This was a very motivating devotional and I encourage you to check it out.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%20for%2011-28-16.mp3"
    ],
    "Devotionals for 11-21-16": [
        "Mon Nov 21, 2016",
        "Tony's message was all about giving thanks. 1 Thessalonians 5:18 \"in everything give thanks; for this is the will of God in Christ Jesus for you.\" Thankfulness is common and easy when things are going well but as Christians, we are to be thankful always. Why should we be thankful when times are tough? Check out the audio link below for Tony's explanation.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSSFEwUGR2aDAwNlk/view?usp=sharing"
    ],
    "Devotionals for 11-7-16": [
        "Mon Nov 07, 2016",
        "Have you ever heard the phrase \"time heals all wounds\"? Tony challenges the accuracy of that statement and rightly asserts that real and complete healing comes from the Lord. This was a wonderful message with some great testimonies to go with it. Enjoy",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSRnktUE5ZUDRfWGM/view?usp=sharing"
    ],
    "Devotionals for 10-24-16": [
        "Mon Oct 24, 2016",
        "Tonight's message was especially beneficial for me tonight. Tony taught us that the love the Lord shows us is so great that there is no way we could possibly love him back in the same way. My favorite line from tonight's message:  \"No matter what you're going through, Christ can and will make it for your betterment. Each and every step you take on your journey, our Lord is with you.\"",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%20for%2010-24-16.mp3"
    ],
    "Devotionals for 10-10-16": [
        "Mon Oct 10, 2016",
        "Tony's message tonight was about trust. Who and what we put our trust in is very important and if misplaced can lead us down the wrong path.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSaG1CNEhGV2I4MXM/view?usp=sharing"
    ],
    "Devotionals for 10-3-16": [
        "Mon Oct 03, 2016",
        "Our devotional tonight was about our decisions and indecisions. David made some great illustrations about the importance and consequences of our choices.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%20for%2010-3-16.mp3"
    ],
    "Devotionals for 9-26-16": [
        "Mon Sep 26, 2016",
        "The message tonight focused on the story of Gideon. God intentionally paired down Gideon's army so no one would doubt His involvement. In the same way Tony shared a story from his own life where he was reminded that all blessings come not from the work of our hands, but from God.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%20for%209-26-16.mp3"
    ],
    "Devotionals for 9-19-16": [
        "Mon Sep 19, 2016",
        "David's devotional this week was all about the mountain top and the valley. The cycle of our lives will always take us through many ups and downs. Finding contentment and strength in God is key to everywhere we may find ourselves.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%20for%209-19-16.mp3"
    ],
    "Devotionals for 9-12-16": [
        "Mon Sep 12, 2016",
        "Tony brought us a message tonight that centered around listening God. The world will have all manner of opinions about who you should be and how you should act. God's plan for you is personal and we should seek him out to know the difference between what the world wants and what He desires for us. Our message tonight was followed by some truly wonderful fellowship. What an amazing time. Thanks everyone for coming out and making this special.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%20for%209-12-16.mp3"
    ],
    "Devotionals for 9-5-16": [
        "Mon Sep 05, 2016",
        "Are you tired? Beat down? In need of rest? Yes, I'm talking to you. Give a listen to this week's devotional. David shared a timely and needed message about taking comfort and rest when the world is dragging us down and wearing us out.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%209-5-16.mp3"
    ],
    "Devotionals for 8-26-16": [
        "Mon Aug 29, 2016",
        "When I think of the story of Jacob and Esau my mind immediately thinks of treachery and deception. Tony shared a different perspective on this tonight in our devotional. He taught us that even though Esau most certainly was wronged by his brother, the real story here is one of true forgiveness.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%208-29-16.mp3"
    ],
    "Devotionals for 8-22-16": [
        "Mon Aug 22, 2016",
        "Tony challenged us tonight to think about perseverance in a slightly different way. His devotional teaches us that God's glory can be shown all the more by inviting Him to shoulder even our everyday struggles.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%208-22-16.mp3"
    ],
    "Devotionals for 8-15-16": [
        "Mon Aug 15, 2016",
        "David's message this week was about timidness and why we should strive to over come it. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%208-15-16.mp3"
    ],
    "Devotionals for 8-8-16": [
        "Mon Aug 08, 2016",
        "David's message tonight was about boldness. My favorite line from the message: \"Jesus did not come to make you safe, he came to make you dangerous to the kingdom of darkness\".",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%208-8-16.mp3"
    ],
    "Devotionals for 8-1-16": [
        "Mon Aug 01, 2016",
        "Tony's message tonight was all about stepping out in faith. It can be tough for some to put even the little things in God's hands but he loves to use those moments to remind us of his continuing presence in our lives.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%208-1-16.mp3"
    ],
    "Devotionals for 7-18-16": [
        "Mon Jul 18, 2016",
        "Tony's message tonight examines Paul's walk with God as is was recorded in Philippians and what we can learn from him.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%207-18-16.mp3"
    ],
    "Devotionals for 7-11-16": [
        "Wed Jul 13, 2016",
        "David's message tonight was all about hearing God amongst the chaos of this world. Often times we are looking for fires, earthquakes and floods but God my be talking to us in a mere whisper if we would only be still and listen. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%207-11-16.mp3"
    ],
    "Devotionals for 6-27-16": [
        "Mon Jun 27, 2016",
        "Tonight's message was all about sticking to God's plan. Tony talked about how interjecting our own plan is not the right way to go. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%206-27-16.mp3"
    ],
    "Devotionals for 6-20-16": [
        "Mon Jun 20, 2016",
        "David brought us a great devotional tonight. For those that couldn't make it out to hear it live I'll attempt to entice you to give it a listen with this question: What lays at the bottom of the ocean and twitches? Check out this great message for the answer. (No spoilers people, I mean it :)",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%206-20-16.mp3"
    ],
    "Devotionals for 6-13-16": [
        "Mon Jun 13, 2016",
        "Tony's message tonight was all about encouragement of others. Sometimes we try to be encouraging but fail with our own words. With our focus on God's word we can truly encourage people in a meaningful way.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%206-13-16.mp3"
    ],
    "Devotionals for 6-6-16": [
        "Mon Jun 06, 2016",
        "David's message tonight was all about God's love for us. There is truly nothing greater then the love he has shown us no matter how little we deserve it.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%206-6-16.mp3"
    ],
    "Devotionals for 5-23-16": [
        "Mon May 23, 2016",
        "Gavin shared a great message tonight about cultivating righteous desires. This was a really uplifting devotional. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%205-23-16.mp3"
    ],
    "Devotionals for 5-16-16": [
        "Mon May 16, 2016",
        "Tony's message tonight was about community. This was a great reminder about how a group of fellow believers can support us and draw us ever closer to God.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%205-16-16.mp3"
    ],
    "Devotionals for 5-9-16": [
        "Mon May 09, 2016",
        "David shared a message tonight about the nature of the Holy Spirit and called us to understand more fully it's roll in guiding our lives.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%205-9-16.mp3"
    ],
    "Devotionals for 5-2-16": [
        "Mon May 02, 2016",
        "Wonderful devotional tonight dealing with the heart. Tony shared an honest and instructive story of how the Lord healed his broken heart and helped him face down and move beyond a difficult situation in his life. What followed was an uplifting fellowship time. Thanks to Tony for sharing tonight and to everyone who came out. Truly an uplifting time.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%205-2-16.mp3"
    ],
    "Devotionals for 4-25-16": [
        "Mon Apr 25, 2016",
        "David brings us an uplifting message tonight about the \"worth\" we have to God. He also shared a song that help inspire the message this week. Links are below. Give a listen to the devotional and then check out the song to a truly empowering experience :D",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%204-25-16.mp3"
    ],
    "Devotionals for 4-18-16": [
        "Mon Apr 18, 2016",
        "Tony brings us a message tonight about waiting. It's pretty safe to say that most, if not all of us struggle with this. My favorite line from tonight's message: And the small four letter word love doesn't give justice to the magnitude and complexity of the love that the Lord has for us. Individually. Singularly.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%204-18-16.mp3"
    ],
    "Devotionals for 4-11-16": [
        "Mon Apr 11, 2016",
        "David's message tonight was all about patience. This is an area that all of us could use reminders about. We had a great turn out tonight and heard so much praise for all the blessings and answers to prayers. Truly an uplifting time.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%204-11-16.mp3"
    ],
    "Devotionals for 4-4-16": [
        "Mon Apr 04, 2016",
        "Tonight's devotional is all about giving, as in giving to the Lord the things that worry us or scare us. Tony pulls from 1 Peter 5:7 \"Casting all you care upon him, for he careth for you\"",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%204-4-16.mp3"
    ],
    "Devotionals for 3-28-16": [
        "Mon Mar 28, 2016",
        "David brings us a call to action in our devotional this week. My favorite line: \"God loves you enough to accept you where you are at, but he loves you so much he wont leave you there.\"",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%203-28-16.mp3"
    ],
    "Devotionals for 3-21-16": [
        "Mon Mar 21, 2016",
        "Tony talks tonight was about God's jealousy for our hearts. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%203-21-16.mp3"
    ],
    "Devotionals for 3-14-16": [
        "Mon Mar 14, 2016",
        "Discernment is the topic for tonight's devotional. David reminds us of just how important this is in guiding us down God's path.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%203-14-16.mp3"
    ],
    "Devotionals for 3-7-16": [
        "Sat Mar 12, 2016",
        "Tony's message tonight revolved around the question \"Do I really need to do the right thing?\" (spoiler..yes you do :) Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%203-7-16.mp3"
    ],
    "Devotionals for 2-22-16": [
        "Tue Feb 23, 2016",
        "Tony's message tonight was about loving thy neighbor. For me, this is a reminder that I need constantly.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%202-22-16.mp3"
    ],
    "Memorial devotional for Jay Norris": [
        "Tue Feb 16, 2016",
        "Tonight we held a special memorial for our dear friend Jay. This was truly a wonderful and uplifting night full of awesome insights in to God's comforting word as well as heartfelt testimonies about the power and grace the Lord has shown us.While pain of separation is present, it is dwarfed by the joy that comes from knowing that Jay is exactly where we all long to be. His impact and legacy lives on here on earth and is a shining example to us about what it is to be a light for Christ. Thanks be to God for the life of Jay Norris.",
        "https://dl.dropboxusercontent.com/u/102133784/Memorial%20devotional%20for%20Jay%20Norris.mp3"
    ],
    "Devotionals for 2-1-16": [
        "Mon Feb 01, 2016",
        "Tonight's devotional is all about having some chutzpah. David brings us a message designed to motivate us in doing the Lord's work.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%202-1-16.mp3"
    ],
    "Devotionals for 1-25-16": [
        "Tue Jan 26, 2016",
        "Fear is the topic of tonight's devotional. Tony's message was all about God telling us not to fear. It was a wonderful devotional and we had a nice time sharing afterwards. Thanks to all who came out and shared this very special time. Everyone is welcome to join us every Monday night for messages like this and more. We also offer up prayer requests and praise reports and are lead in prayer after the devotional. It is the highlight of my week :D",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%201-25-16.mp3"
    ],
    "Devotionals for 1-18-16": [
        "Mon Jan 18, 2016",
        "David's message tonight centered around the idea of thirst, that is thirst for the Lord. \"But whosoever drinketh of the water that I shall give him shall never thirst; but the water that I shall give him shall be in him a well of water springing up into everlasting life.\"",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%201-18-16.mp3"
    ],
    "Devotionals for 1-11-16": [
        "Mon Jan 11, 2016",
        "Tonight's devotional was about faith. Tony's message centered around the importance of faith and how much our faith pleases God. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%201-11-16.mp3"
    ],
    "Devotionals for 12-21-15": [
        "Mon Dec 21, 2015",
        "David's message tonight centered around how seeming impossible and amazing Christs coming to earth was. Truly a blessing to us all. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Davotionals%20for%2012-21-15.mp3"
    ],
    "Devotionals for 12-14-15": [
        "Mon Dec 14, 2015",
        "Tony's message tonight was about the comfort that God's love brings. Enjoy :D",
        "https://dl.dropboxusercontent.com/u/102133784/Davotionals%20for%2012-14-15.mp3"
    ],
    "Devotionals for 12-7-15": [
        "Mon Dec 07, 2015",
        "The devotional for this week focuses around the idea of standing in wall. David reminds us that we need to be a willing vessel for the Lord.",
        "https://dl.dropboxusercontent.com/u/102133784/Davotionals%20for%2012-7-15.mp3"
    ],
    "Devotionals for 11-30-15": [
        "Mon Nov 30, 2015",
        "For tonight's devotional Tony shared a message about spiritual warfare. This can be so sneaky and destructive but fortunately Tony gives some practical advise on how to identify it and deal with it.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%2011-30-15.mp3"
    ],
    "Devotionals for 11-23-15": [
        "Mon Nov 23, 2015",
        "For tonight's devotional David brought us a much needed message of perseverance. Super awesome and really spoke to me tonight. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%2011-23-15.mp3"
    ],
    "Devotionals for 11-16-15": [
        "Mon Nov 16, 2015",
        "Tony's devotional tonight was on prayer.  Not general prayers but speaking directly and specifically to God about our needs and concerns.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%2011-16-15.mp3"
    ],
    "Devotionals for 11-9-15": [
        "Mon Nov 09, 2015",
        "Quick...do you know the difference between grace and mercy? David's message this week covers that and how we should respond to the grace God gives to us. Enjoy :D",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%2011-9-15.mp3"
    ],
    "Devotionals for 11-2-15": [
        "Mon Nov 02, 2015",
        "Tony shared a message about forgiveness tonight that really hit home for many of us. We had a truly wonderful time after the devotional sharing stories of hope and blessings. Thank you to every for your on going fellowship. What a huge blessing this group is :D",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%2011-2-15.mp3"
    ],
    "Devotionals for 10-26-15": [
        "Mon Oct 26, 2015",
        "Tonight David brings us a PSA about heart troubles.  Not the kind that can land you in the ER but heart troubles that can kill you spiritually. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%2010-26-15.mp3"
    ],
    "Devotionals for 10-19-15": [
        "Mon Oct 19, 2015",
        "Tony was gracious enough to answer the last minute call to lead devotionals tonight. We studied the book of Numbers and specifically the conflict between Korah and Moses. This was a great lesson about the importance of following the will of the Lord.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%2010-19-15.mp3"
    ],
    "Devotionals for 10-12-15": [
        "Mon Oct 12, 2015",
        "Tony shared an informative and personal devotional about the love of Christ. It was really great to hear what God has laid on his heart this week. Check out the audio link below.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%2010-12-15.mp3"
    ],
    "Devotionals for 10-5-15": [
        "Mon Oct 05, 2015",
        "Tonight David brings us a challenging message about the three stages of doing more for God. Check it out.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%2010-5-15.mp3"
    ],
    "Devotionals for 9-28-15": [
        "Mon Sep 28, 2015",
        "Tony did an awesome job tonight leading devotionals for us. To sum up tonight's message and directly quote him at the same time...\"Don't base your walk with Christ on what someone else is doing, but on what the Lord would have you do.\"",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%209-28-15.mp3"
    ],
    "Devotionals for 9-14-15": [
        "Mon Sep 14, 2015",
        "The topic of tonight's devotional is when God answers before we ask. Really powerful stuff. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%209-14-15.mp3"
    ],
    "Devotionals for 8-24-15 and 9-7-15": [
        "Mon Sep 07, 2015",
        "Once again I have slipped on getting the devotional posted in a timely fashion so this week will be a bonus double posting :D These are two, really great devotionals on prayer and worrying respectively. Take a few minutes and give them a listen. Totally worth your time.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%208-24-15.mp3"
    ],
    "Devotionals for 8-17-15": [
        "Mon Aug 17, 2015",
        "Tonight's devotional was a really uplifting message about what we say and what we believe and how they interconnect. Definitely raised my spirits.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%208-17-15.mp3"
    ],
    "Devotionals for 8-10-15": [
        "Mon Aug 10, 2015",
        "We had a really fantastic devotional tonight and an awesome turn out. David shared a message about the importance and benefits of ministering. Wonderful fellowship followed and I want to thank everyone for coming out. For those who couldn't make it...",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%208-10-15.mp3"
    ],
    "Devotionals for 8-3-15": [
        "Mon Aug 03, 2015",
        "David brings us a most timely message on the reasons we go through tough times. I personally enjoyed the story about the silver smith a lot. Awesome stuff.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%208-3-15.mp3"
    ],
    "Devotionals for 7-27-15": [
        "Mon Jul 27, 2015",
        "Are you choosing to live in a land of defeat? David shares an inspirational message of hope and strength. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%207-27-15.mp3"
    ],
    "Devotionals for 7-6-15 and 7-13-15": [
        "Mon Jul 13, 2015",
        "Devotional posting from last week was delayed because reasons...but this week we have a double dose of God's word to catch you up. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%207-6-15.mp3"
    ],
    "Devotionals for 6-29-15": [
        "Mon Jun 29, 2015",
        "Edification is the topic for tonight's devotional. Yet another great message followed by some wonderful fellowship (only the message is recorded). Thanks to everyone who came out and joined us tonight. Just a reminder, we try to do these devotionals every Monday at 8:30c so if your around and want to check these out for yourself feel free to hop in mumble with us. :D",
        "https://www.dropbox.com/s/khw7er891cidrf4/Devotionals%206-29-15.mp3?dl=0"
    ],
    "Devotionals for 6-15-15": [
        "Mon Jun 15, 2015",
        "Do you actually know what holiness is? David brings us some great information and understanding on this rarely talked about subject.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%206-15-15.mp3"
    ],
    "Devotionals for 6-8-15": [
        "Tue Jun 09, 2015",
        "David is on fire tonight sharing an awesome message about forgiveness and lets be honest...this is a lesson we could all benefit from. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%206-8-15.mp3"
    ],
    "Devotionals for 6-1-15": [
        "Sat Jun 06, 2015",
        "My personal favorite quote from tonight's devotional about light was this...I believe in Christianity as I believe that the sun has risen: not only because I see it, but because by it I see everything else.C. S. LewisEnjoy :D",
        "http://www.brainyquote.com/quotes/authors/c/c_s_lewis.html"
    ],
    "Devotionals for 5-25-15": [
        "Mon May 25, 2015",
        "In honor of Memorial Day, tonight's devotional made an awesome parallel between the sacrifice of the solider for our freedom and the sacrifice Jesus made for us to free us from sin. We had a great turn out tonight and a wonderful conversation afterwords. I encourage everyone that can to join is are these are a great time of fellowship.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%205-25-15.mp3"
    ],
    "Devotionals for 5-11-15": [
        "Wed May 13, 2015",
        "David brought us an awesome message tonight about being the apple of Gods eye. Definitely worth a listen.If you have ever been curious about what its like to attend our weekly devotional...David always brings us a message, which is recorded (audio linked here). Once the recording has stopped we ask if anyone wants to share a prayer request or praise report and then David lead us in prayer. You are not required to talk or share if you don't want to. Listening only is just fine :)",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%205-11-15.mp3"
    ],
    "Devotionals for 4-20-15": [
        "Mon Apr 20, 2015",
        "David shares a really cool story from one of my personal favorite slices of history...Scottish history :DFor those that have not joined us for devotionals...it has become the highlight of my week and what you don't get to hear on the audio is the awesome time we have sharing our prayer requests and praise reports. Thanks all for making this such a special event.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%204-20-2015.mp3"
    ],
    "Devotionals for 4-6-15": [
        "Sun Apr 12, 2015",
        "Now that we have celebrated Easter David brings a message of how we should respond to this glorious event.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%204-6-2015.mp3"
    ],
    "Devotionals for 3-30-15": [
        "Mon Mar 30, 2015",
        "The story of Lazarus continues tonight with the triumphant entry (John 12). Enjoy :D",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%203-30-2015.mp3"
    ],
    "Devotionals for 3-16-15": [
        "Thu Mar 19, 2015",
        "Happy John 3:16 day :D  Tonight David brought us a message about freedom. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%203-16-2015.mp3"
    ],
    "Devotional for 3-9-15": [
        "Tue Mar 10, 2015",
        "David shares the amazing story of Gideon and how God uses the most unprepared people at times to do his work.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%203-9-2015.mp3"
    ],
    "Our special devotional dedicated to our friend Jason 3-2-15": [
        "Mon Mar 02, 2015",
        "Tonight's devotional was dedicated to our departed friend Jason. We had a wonderful discussion after the message and I want to thank everyone for coming out and making this a very special night.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%203-2-2015.mp3"
    ],
    "Devotionals for 2-23-15": [
        "Mon Feb 23, 2015",
        "Is there a wrong way to pray? You might actually be surprised by this one. David shares a great message on what the scripture says about prayer.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%202-23-2015.mp3"
    ],
    "Devotional for 2-16-15": [
        "Mon Feb 16, 2015",
        "Ever heard someone go through the entire bible in 7 minutes? This just might be breaking some records.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%202-16-2015.mp3"
    ],
    "Devotional for 2-2-15": [
        "Mon Feb 02, 2015",
        "David brings us a message of the tremendous value God has for us. This was a really uplifting devotional. Definitely worth a listen.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%202-2-2015.mp3"
    ],
    "Devotional for 1-26-15": [
        "Mon Jan 26, 2015",
        "Really great message this week from David. If you have never joined us for the devotional or just missed it this week give it a listen. You wont be disappointed.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%201-26-2015.mp3"
    ],
    "Devotional for 1-19-15": [
        "Mon Jan 19, 2015",
        "David talks to us tonight about the bible and its purpose in our lives. Favorite line for me...\"God's word is like salt in the back of you car in winter. It's a lot more useful when you take it out and apply it.\"",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%201-19-2015.mp3"
    ],
    "Devotional for 1-12-15": [
        "Mon Jan 12, 2015",
        "What does it mean to carry your cross? David's topic centers around this very question.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotional%201-12-2015.mp3"
    ],
    "Devotionals for 12-22-14 and 1-5-15": [
        "Wed Jan 07, 2015",
        "Here is the last devotional for 2014 and the first for 2015. David talks to us about the staggering number of prophecies fulfilled by Jesus's birth and then give a rallying cry to get people back to church and the amazing fellowship that can be found there. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%2012-22-14.mp3"
    ],
    "Devotionals for 12-1 and 12-14": [
        "Tue Dec 09, 2014",
        "We have had a fantastic turnout for devotionals these past weeks. Thanks to everyone for coming out and hearing David share the good news of our Lord. I know I look forward to these every week and I hope you do too.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%2012-1-14.mp3"
    ],
    "Devotionals for 11-24-14": [
        "Tue Nov 25, 2014",
        "David brings us a message of Thanksgiving and explains why really dislikes it when people say \"Be thankful because at least you don't have it as bad as (insert person or situation that is worse then yours)\"",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%2011-24-14.mp3"
    ],
    "Devotionals for 11-17-14": [
        "Mon Nov 17, 2014",
        "David is back to bring another awesome message. We had a great turn out tonight followed by an amazing discussion. Lots of great shearing. Thanks everyone for coming out.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%2011-17-14.mp3"
    ],
    "Devotional for 10-27-14": [
        "Mon Oct 27, 2014",
        "David brings us a devotional tonight on perseverance. Something we all need...trust me.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%2010-27-14.mp3"
    ],
    "Devotionals for 10-20-14": [
        "Mon Oct 20, 2014",
        "In tonight's devotional David explains how joy is not the same as happiness and how we can use joy to carry us through difficult times.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%2010-20-14.mp3"
    ],
    "Devotionals for 10-13-14": [
        "Mon Oct 13, 2014",
        "Great devotional tonight followed by an awesome discussion. Thanks all for coming out to share in God's word and thanks again to David for leading.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%2010-13-14.mp3"
    ],
    "Devotionals for 9-29-14": [
        "Mon Sep 29, 2014",
        "Here is David Bowyer's devotional all about integrity.   (Download link.)",
        "http://desertdwarf.com/renewedhope/devotionals/Renewed%20Hope%20Devotional%20-%20Integrity%202014-09-29.mp3"
    ],
    "Devotionals for 9-1-14 and 9-8-14": [
        "Wed Sep 24, 2014",
        "I am now officially running out of excuses why I have not posted these sooner. Please enjoy two of our most recent devotionals...",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%209-1-14.mp3"
    ],
    "Devotionals for 8-18-14 and 8-25-14": [
        "Fri Aug 29, 2014",
        "My devotional posting hit a massive lag spike :p  Here are the last two devotionals for your listening pleasure. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%208-18-14.mp3"
    ],
    "Devotionals for 8-4-14": [
        "Tue Aug 05, 2014",
        "ATTENTION: PAUL REVEALS HIMSELF AS THE FATHER OF CAPS LOCKING...well sorta.Chris returns this week to bring us the conclusion of his series on Galatians. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%208-4-14.mp3"
    ],
    "Devotionals for 7-28-14": [
        "Mon Jul 28, 2014",
        "Are you haunted by your past? Still living in the glory of days gone by? David shares a message about focusing on our past instead of moving forward. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%207-28-14.mp3"
    ],
    "Devotionals for 7-21-14": [
        "Mon Jul 21, 2014",
        "Are you like the bee, the bat and the vulture? Find out from tonight's devotional.",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%207-21-14.mp3"
    ],
    "Devotionals 6-30-14": [
        "Mon Jun 30, 2014",
        "David shared a message tonight about all the crazy amazing things that can happen when we follow Gods path. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%206-30-14.mp3"
    ],
    "Devotionals 6-16-14": [
        "Mon Jun 16, 2014",
        "David shared an interesting illustration tonight about how we can feel trapped by our own sin. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%206-16-14.mp3"
    ],
    "Devotionals 6-9-14": [
        "Mon Jun 09, 2014",
        "Ever uttered the words \"..but I wasn't going to stoop to their level\"? Paul talks to us about the special burden we must bare as believers in the saved by faith doctrine. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%206-9-14.mp3"
    ],
    "Devotionals 5-26-14": [
        "Wed May 28, 2014",
        "David returns this week to brings us a message about grace. Enjoy",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%205-26-14.mp3"
    ],
    "Devotionals 5-19-14": [
        "Mon May 19, 2014",
        "Devotionals this week focus on the practical application of Paul's teaching. Thing to avoid, things to adhere to. Great instruction to live by.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSWW8xZmJoZkdZaWs/view?usp=sharing"
    ],
    "Devotionals 5-5-14 to 5-12-14": [
        "Mon May 19, 2014",
        "Late as always in posting this..uggg. Thank you as always to Chris to leading these devotionals. We really appreciate your instruction each week.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSRXBHSkhRMDRXV3c/view?usp=sharing"
    ],
    "Devotionals 4-21-14 and 4-28-14": [
        "Mon Apr 28, 2014",
        "Once again I have saved a devotional so that I can post two at once.....totally intentional ;)Enjoy",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSdlhiWWFwRE0zTzQ/view?usp=sharing"
    ],
    "Devotionals 4-14-14": [
        "Sat Apr 19, 2014",
        "The awesomeness of Paul is brought to you this week by....Chris. Enjoy :D",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSbFU5aUxOd1QwNDg/view?usp=sharing"
    ],
    "Devotionals 3-24-14 and 3-31-14": [
        "Mon Mar 31, 2014",
        "Two devotionals for the price of one :D  Enjoy",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSekhhZWF4YzNYckk/view?usp=sharing"
    ],
    "Devotionals 3-10-14": [
        "Fri Mar 21, 2014",
        "Late, but not forgotten.....Here is the devotional from last Monday. Enjoy Click for the devotional audio from 3-10-14",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSekFBbzU3NTFsQjA/view?usp=sharing"
    ],
    "Devotionals 3-3-14": [
        "Sun Mar 09, 2014",
        "Chris continues his series from Galatians. Thanks again to Chris for bringing  us another great look into the word of God. Enjoy",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSUXdvSldGSWZIRjA/view?usp=sharing"
    ],
    "Devotionals 2-24-14": [
        "Mon Feb 24, 2014",
        "Another great devotional by Chris. If God asked you why you should get to heaven, do you have the right answer? Hear his thoughts on this most critical of topics.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSUjVTbVhDWjdkbk0/view?usp=sharing"
    ],
    "Devotionals 1-30-14": [
        "Sat Feb 01, 2014",
        "Chris took us another step further into Glaciation. Really great theology here. Give a listen.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSRTZwZHNEek1xcEk/view?usp=sharing"
    ],
    "Devotionals 11-21-13": [
        "Fri Nov 22, 2013",
        "Chris tackles one of the trickier bits of Galatians. Really interesting insight here on one of the more debatable sections of the bible. Enjoy",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSSFEwUGR2aDAwNlk/view?usp=sharing"
    ],
    "Devotionals for 11-7-13": [
        "Fri Nov 08, 2013",
        "This weeks devotional: Trust, circumcision, and the first ever ROFL. Check it out. Thanks again to Chris for doing such a great job with these.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSRnktUE5ZUDRfWGM/view?usp=sharing"
    ],
    "Devotionals for 10-24-13": [
        "Sat Oct 26, 2013",
        "David shared a great message about the importance of encouragement. Enjoy",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSOWhnTlZONHdyVU0/view?usp=sharing"
    ],
    "Devotionals for 10-17-13": [
        "Sun Oct 20, 2013",
        "Chris continued his series on Galatians adding his own insight into the teaching of Paul. Enjoy",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSWkM2bjVVZTctb1E/view?usp=sharing"
    ],
    "Devotionals for 10-10-13": [
        "Thu Oct 10, 2013",
        "Tonight's devotional was about staying true to the gospel of Jesus as told by Paul. Thanks again to Chris for sharing this message. Enjoy https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%2010-10-13.mp3",
        "https://dl.dropboxusercontent.com/u/102133784/Devotionals%20for%2010-10-13.mp3"
    ],
    "Devotionals for 10-3-13": [
        "Fri Oct 04, 2013",
        "For Thursday nights devotional Chris shared a awesome message about personally held beliefs and those taught to us directly by God through the letters of Paul in Galatians. Enjoy",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSVlY3NEdDd3lyeGM/view?usp=sharing"
    ],
    "Devotionals for 9-15-13": [
        "Sun Sep 15, 2013",
        "David gave yet another great message about getting involved in peoples lives. Enjoy",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSam0tcmtHZ1NtZ0E/view?usp=sharing"
    ],
    "Devotionals for 8-22-13": [
        "Thu Aug 29, 2013",
        "David gave an amazing analogy between the urgency of sharing God's word and a truly scary event that happened to him recently.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSYVpLYjVEcWstb0U/view?usp=sharing"
    ],
    "Devotionals for 7-25-13": [
        "Thu Jul 25, 2013",
        "David shared a great message tonight about integrity. This one is highly recommended. And I would also like to thank everyone for getting on for devotionals. We had a great group and shared some prayers and praises. Awesome stuff.",
        "https://drive.google.com/file/d/0B2MYSYaKMrwSWHhLQ2NwVlNoeU0/view?usp=sharing"
    ],
    "Devotionals for 7-18-13": [
        "Sun Jul 21, 2013",
        "David shared another awesome message on our way vs. God's way. Enjoy",
        "https://drive.google.com/file/d/0B2MYSYaKMrwScDRCaWVfT1dkVWM/view?usp=sharing"
    ]
}